src/mp_toir/Documents/мп_ЗаданиеНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_ЗаданиеНаРемонт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаРемонт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаказНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнениеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателяИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмеренияПроверкиВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоотчетОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщиеВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехРешение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МатериалыКСписанию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоматическиДобавленнаяСтрока</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаХарактеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаСерия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыКОприходованию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фотографии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УстановленныеТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_ИсточникиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_ИсточникиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МечелТОиР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_ЗаданиеНаРемонт/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИменаСтраниц;

&НаКлиенте
Перем ТекущийИндексСтраницы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИменаСтраниц = Новый Массив;
	ИменаСтраниц.Добавить("ГруппаШапка");
	ИменаСтраниц.Добавить("ГруппаОсновная");
	ИменаСтраниц.Добавить("ГруппаОсновная2");
	ИменаСтраниц.Добавить("ГруппаФото");
	ИменаСтраниц.Добавить("ГруппаСписание");
	ИменаСтраниц.Добавить("ГруппаОприходование");
	ИменаСтраниц.Добавить("ГруппаИсполнители");
	ИменаСтраниц.Добавить("ГруппаДополнительно");
	
	ЭтотОбъект.КоличествоСтраниц = ИменаСтраниц.Количество() - 1;
	
	ТекущийИндексСтраницы = 0;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
	ДоступностьРеквизитовНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ЭтотОбъект.ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Подразделение = РеквизитыКонстант["ПодразделениеПользователя"];
		Объект.Ответственный = ЭтотОбъект.ТекущийПользователь;
		Объект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан;
		Объект.Источник = Перечисления.мп_ИсточникиДокументов.МечелТОиР;
	Иначе
		ЭтотОбъект.ТаблицаФотографии.Загрузить(Объект.Фотографии.Выгрузить());
		Для Каждого ТекСтрока Из ЭтотОбъект.ТаблицаФотографии Цикл
			ДвоичныеДанные = Base64Значение(ТекСтрока.Фото);
			АдресФото = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ТекСтрока.ИдентификаторСтроки);
			ТекСтрока.ФотоПредставление = АдресФото;
		КонецЦикла;
	КонецЕсли;
	Если Параметры.Свойство("ОткрытИзНаряда") Тогда
		ЭтотОбъект.ОткрытИзНаряда = Параметры.ОткрытИзНаряда;
	КонецЕсли;
	Если Параметры.Свойство("НомерСтрокиНаряда") Тогда
		ЭтотОбъект.НомерСтрокиНаряда = Параметры.НомерСтрокиНаряда;
	КонецЕсли;
	
//	ДоступностьРеквизитов();

	ВидимостьРеквизитов();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЧтениеНаСервере();
	ВидимостьРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЧтениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Документ.мп_ЗаданиеНаРемонт.Форма.ФормаСтрокиСписания" Тогда

		ДанныеСтроки = Объект.МатериалыКСписанию.НайтиПоИдентификатору(ИсточникВыбора.НомерСтроки);
		Если ИсточникВыбора.СохранитьИзменения Тогда
	
			Модифицированность = Истина;

			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ИсточникВыбора);
			ДанныеСтроки.ЭтоНоваяСтрока = Ложь;
			ЧтениеНаСервере();
		Иначе

			Если ДанныеСтроки.ЭтоНоваяСтрока Тогда
				НомерСтроки = Объект.МатериалыКСписанию.Количество();
				Объект.МатериалыКСписанию.Удалить(НомерСтроки - 1);
			КонецЕсли;

		КонецЕсли;
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.мп_ЗаданиеНаРемонт.Форма.ФормаСтрокиОприходования" Тогда
		ДанныеСтроки = Объект.МатериалыКОприходованию.НайтиПоИдентификатору(ИсточникВыбора.НомерСтроки);
		Если ИсточникВыбора.СохранитьИзменения Тогда
	
			Модифицированность = Истина;

			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ИсточникВыбора);
			ДанныеСтроки.ЭтоНоваяСтрока = Ложь;
			ЧтениеНаСервере();
		Иначе

			Если ДанныеСтроки.ЭтоНоваяСтрока Тогда
				НомерСтроки = Объект.МатериалыКОприходованию.Количество();
				Объект.МатериалыКОприходованию.Удалить(НомерСтроки - 1);
			КонецЕсли;

		КонецЕсли;
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.Пользователи.Форма.ФормаВыбораИзДокумента" Тогда
		ДанныеСтроки = Объект.Исполнители.НайтиПоИдентификатору(ИсточникВыбора.НомерСтроки);
		Если ИсточникВыбора.СохранитьИзменения Тогда
			Модифицированность = Истина;
			ВыбранныеИсполнители(ИсточникВыбора.Ответственный);
//			ДанныеСтроки.ЭтоНоваяСтрока = Ложь;
		//Иначе
		//	Если ДанныеСтроки.ЭтоНоваяСтрока Тогда
		//		НомерСтроки = Объект.Исполнители.Количество();
		//		Объект.Исполнители.Удалить(НомерСтроки - 1);
		//	КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыбранныеИсполнители(Знач ИсполнителиИзФормыПодбора)
	ТаблицаИсполнителей = Объект.Исполнители.Выгрузить();
	Для Каждого ИсполнительИзФормы Из ИсполнителиИзФормыПодбора Цикл
		Если ТаблицаИсполнителей.Найти(ИсполнительИзФормы.Значение, "Ответственный") = Неопределено Тогда
			НоваяСтрока = ТаблицаИсполнителей.Добавить();
			НоваяСтрока.Ответственный = ИсполнительИзФормы.Значение;
		КонецЕсли;
	КонецЦикла;
	Объект.Исполнители.Загрузить(ТаблицаИсполнителей);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СписокОшибок = КонтрольОстатковМатериаловСписания();
		Если СписокОшибок.Количество() Тогда
			Отказ = Истина;
			СтрСообщение = "Превышен остаток:";
			РаздСтрок = Символы.ПС;
			Для Каждого ТекСтрока Из СписокОшибок Цикл
				ОписаниеОшибки = СтрШаблон("Для %1 на %2", ТекСтрока.Номенклатура, ТекСтрока.Факт - ТекСтрока.Остаток);
				СтрСообщение = СтрСообщение + РаздСтрок + ОписаниеОшибки;
			КонецЦикла;
			СтрСообщение = СтрСообщение +РаздСтрок + "Обновить остатки?";
			ОповещениеОшибки = Новый ОписаниеОповещения("ОбновлениеОстатков", ЭтотОбъект);
			ПоказатьВопрос(ОповещениеОшибки, СтрСообщение, РежимДиалогаВопрос.ДаНет, 60);
		Иначе
			ИзменитьСтатусОбмена();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЭтотОбъект.ОткрытИзНаряда Тогда
		ЗначениеФормы = Новый Структура;
		ЗначениеФормы.Вставить("ОткрытИзНаряда", ЭтотОбъект.ОткрытИзНаряда);
		ОповеститьОВыборе(ЗначениеФормы);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЭтотОбъект.ОткрытИзНаряда И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		АктуальныеРежимы = Новый Массив;
		АктуальныеРежимы.Добавить(РежимЗаписиДокумента.Запись);
		АктуальныеРежимы.Добавить(РежимЗаписиДокумента.Проведение);
		Если Не АктуальныеРежимы.Найти(ПараметрыЗаписи.РежимЗаписи) = Неопределено Тогда
			ОбновитьИсполнителейВНаряде(Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)
	ЭтотОбъект.ТехнологическоеМесто = ТехнологическоеМестоОбъектаЭксплуатации(Объект.ОбъектЭксплуатации);
	ВидимостьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ТехнологическоеМестоПриИзменении(Элемент)

	ТехнологическоеМестоПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)

	Объект.Продолжительность = ВычислитьРазностьДат(Объект.ДатаНачала, Объект.ДатаЗавершения);

КонецПроцедуры

&НаКлиенте
Процедура ДатаЗавершенияПриИзменении(Элемент)
	Объект.Продолжительность = ВычислитьРазностьДат(Объект.ДатаНачала, Объект.ДатаЗавершения);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОперацииПриИзменении(Элемент)
	
	ВыполнениеОперацииПриИзмененииСервер(
		СокрЛП(Объект.ВыполнениеОперации));

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателяИзмеренияПриИзменении(Элемент)
	ЗначениеПоказателяИзмеренияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РезультатПроверкиПриИзменении(Элемент)
	РезультатПроверкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеРаботПриИзменении(Элемент)
	НаименованиеРаботПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)

	ОтветственныйПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалыКСписанию

&НаКлиенте
Процедура МатериалыКСписаниюПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМатериалКСписанию(Команда)
	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Объект.МатериалыКСписанию.Добавить();
	Строка.ЭтоНоваяСтрока = Истина;
	Строка.АвтоматическиДобавленнаяСтрока = Ложь;
	Строка.ИдентификаторСтроки = Новый УникальныйИдентификатор();
	ОткрытьФормуРедактированияСписания(Строка);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМатериалКСписанию(Команда)

	Строка = Элементы.МатериалыКСписанию.ТекущиеДанные;
	Строка.ЭтоНоваяСтрока = Ложь;
	ОткрытьФормуРедактированияСписания(Строка);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияСписания(Строка)
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Номенклатура", Строка.Номенклатура);
	ДанныеСтроки.Вставить("Характеристика", Строка.Характеристика);
	ДанныеСтроки.Вставить("Серия", Строка.Серия);
	ДанныеСтроки.Вставить("Склад", Строка.Склад);
	ДанныеСтроки.Вставить("План", Строка.План);
	ДанныеСтроки.Вставить("Факт", Строка.Факт);
	ДанныеСтроки.Вставить("СтатусУказанияСерий", Строка.СтатусУказанияСерий);
	ДанныеСтроки.Вставить("АвтоматическиДобавленнаяСтрока", Строка.АвтоматическиДобавленнаяСтрока);
	ДанныеСтроки.Вставить("НомерСтроки", Строка.ПолучитьИдентификатор());
	ДанныеСтроки.Вставить("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
	ДанныеСтроки.Вставить("ЗаменаНоменклатура", Строка.ЗаменаНоменклатура);
	ДанныеСтроки.Вставить("ЗаменаХарактеристика", Строка.ЗаменаХарактеристика);
	ДанныеСтроки.Вставить("ЗаменаСерия", Строка.ЗаменаСерия);
	ЭтоКИС= (Объект.Источник = ПредопределенноеЗначение("Перечисление.мп_ИсточникиДокументов.КИС"));
	ДанныеСтроки.Вставить("ТолькоПросмотр", ЭтоКИС);
	ДанныеСтроки.Вставить("СтатусОбмена", Объект.СтатусОбмена);
	ДанныеСтроки.Вставить("Источник", Объект.Источник);
	ДанныеСтроки.Вставить("ОбъектЭксплуатации", Объект.ОбъектЭксплуатации);
	ДанныеСтроки.Вставить("ВыбранныйУзел", Объект.Узел);
	ДанныеСтроки.Вставить("МатериалыКОприходованию", Объект.МатериалыКОприходованию);
	ДанныеСтроки.Вставить("МатериалыКСписанию", Объект.МатериалыКСписанию);

	ОткрытьФорму("Документ.мп_ЗаданиеНаРемонт.Форма.ФормаСтрокиСписания",
		ДанныеСтроки, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуСписания(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

	ИндексСтроки = Элементы.МатериалыКСписанию.ТекущиеДанные.НомерСтроки - 1;
	Объект.МатериалыКСписанию.Удалить(ИндексСтроки);
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалыКОприходованию

&НаКлиенте
Процедура МатериалыКОприходованиюПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКОприходованиюПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМатериалКОприходованию(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

	Строка = Объект.МатериалыКОприходованию.Добавить();
	Строка.ЭтоНоваяСтрока = Истина;

	ОткрытьФормуРедактированияОприходования(Строка);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияОприходования(Строка)

	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Номенклатура", Строка.Номенклатура);
	ДанныеСтроки.Вставить("Характеристика", Строка.Характеристика);
	ДанныеСтроки.Вставить("Серия", Строка.Серия);
	ДанныеСтроки.Вставить("Склад", Строка.Склад);
	ДанныеСтроки.Вставить("СтатусУказанияСерий", Строка.СтатусУказанияСерий);
	ДанныеСтроки.Вставить("НомерСтроки", Строка.ПолучитьИдентификатор());
	ДанныеСтроки.Вставить("НоменклатураВозврат", Строка.НоменклатураВозврат);
	ДанныеСтроки.Вставить("ХарактеристикаВозврат", Строка.ХарактеристикаВозврат);
	ДанныеСтроки.Вставить("СерияВозврат", Строка.СерияВозврат);
	ДанныеСтроки.Вставить("Количество", Строка.Количество);

	ЭтоКИС= (Объект.Источник = ПредопределенноеЗначение("Перечисление.мп_ИсточникиДокументов.КИС"));
	ДанныеСтроки.Вставить("ТолькоПросмотр", ЭтоКИС);
	ДанныеСтроки.Вставить("СтатусОбмена", Объект.СтатусОбмена);
	ДанныеСтроки.Вставить("Источник", Объект.Источник);
	ДанныеСтроки.Вставить("ОбъектЭксплуатации", Объект.ОбъектЭксплуатации);
	ДанныеСтроки.Вставить("ВыбранныйУзел", Объект.Узел);
	ДанныеСтроки.Вставить("МатериалыКОприходованию", Объект.МатериалыКОприходованию);
	ДанныеСтроки.Вставить("МатериалыКСписанию", Объект.МатериалыКСписанию);
	ОткрытьФорму("Документ.мп_ЗаданиеНаРемонт.Форма.ФормаСтрокиОприходования",
		ДанныеСтроки, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМатериалыКОприходованию(Команда)

	Строка = Элементы.МатериалыКОприходованию.ТекущиеДанные;
	Строка.ЭтоНоваяСтрока = Ложь;
	ОткрытьФормуРедактированияОприходования(Строка);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуОприходования(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

	ИндексСтроки = Элементы.МатериалыКОприходованию.ТекущиеДанные.НомерСтроки - 1;
	Объект.МатериалыКОприходованию.Удалить(ИндексСтроки);
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсполнители

&НаКлиенте
Процедура ОткрытьФормуРедактированияИсполнителя()

	ДанныеСтроки = Новый Структура;

	ЭтоКИС= (Объект.Источник = ПредопределенноеЗначение("Перечисление.мп_ИсточникиДокументов.КИС"));
	ДанныеСтроки.Вставить("ТолькоПросмотр", ЭтоКИС);
	ДанныеСтроки.Вставить("СтатусОбмена", Объект.СтатусОбмена);
	ДанныеСтроки.Вставить("Источник", Объект.Источник);
	ДанныеСтроки.Вставить("ТаблицаРаботы", Ложь);

	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбораИзДокумента",
		ДанныеСтроки, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИсполнителя(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

//	Строка = Объект.Исполнители.Добавить();
//	Строка.ЭтоНоваяСтрока = Истина;

	ОткрытьФормуРедактированияИсполнителя();

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтрокуИсполнителя(Команда)
//	Строка = Элементы.Исполнители.ТекущиеДанные;
//	Строка.ЭтоНоваяСтрока = Ложь;
	ОткрытьФормуРедактированияИсполнителя();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуИсполнителя(Команда)
	
	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

	ИндексСтроки = Элементы.Исполнители.ТекущиеДанные.НомерСтроки - 1;
	Объект.Исполнители.Удалить(ИндексСтроки);
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВидРемонтаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ОбъектЭксплуатации = Объект.ОбъектЭксплуатации;
	ВидыРемонтов = ВидыРемонтов(ОбъектЭксплуатации);
	Если ВидыРемонтов = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ВидыРемонтов);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

&НаКлиенте
Процедура СделатьСнимок(Команда)

	#Если НЕ МобильноеПриложениеКлиент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Функция не поддерживается");
		Возврат;
	#КонецЕсли

	Результат = Вычислить("СредстваМультимедиа.СделатьФотоснимок()");
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	РасширениеФайла = Результат.РасширениеФайла;
	ИнициализироватьКартинкуНаФорме(Результат.ПолучитьДвоичныеДанные(), РасширениеФайла);

КонецПроцедуры

&НаКлиенте
Процедура Страница1(Команда)
	НовыйИндекс = Макс(ТекущийИндексСтраницы - 1, 0);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура Страница2(Команда)
	НовыйИндекс = Мин(ТекущийИндексСтраницы + 1, ЭтотОбъект.КоличествоСтраниц);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФото(Команда)

	ТекущиеДанные = Элементы.ТаблицаФотографии.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УдалитьСтроку = ТекущиеДанные.УдалитьСтроку;
	НовыйПризнак = ?(УдалитьСтроку = Истина, Ложь, Истина);
	Элементы.ТаблицаФотографии.ТекущиеДанные.УдалитьСтроку = НовыйПризнак;

	ИзменитьПризнакФото(ТекущиеДанные.ИдентификаторСтроки, НовыйПризнак);

КонецПроцедуры

&НаСервере
Процедура ИзменитьПризнакФото(Знач ИдентификаторСтроки, Знач УдалитьСтроку)

	СтрокиТаблицы = Объект.Фотографии.НайтиСтроки(
		Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
		
	Для Каждого ТекСтрока Из СтрокиТаблицы Цикл
		ТекСтрока.УдалитьСтроку = УдалитьСтроку;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьФотографию(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл'; en = 'Select file'");
	ПараметрыДиалога.Фильтр =  "Изображения|*.png;*.jpg;*.jpeg";
	ЗавершениеОбратныйВызов = Новый ОписаниеОповещения("ЗавершениеОбратныйВызов", ЭтотОбъект);
	ПрогрессОбратныйВызов = Новый ОписаниеОповещения("ПрогрессОбратныйВызов", ЭтотОбъект);
	ПередНачаломОбратныйВызов = Новый ОписаниеОповещения("ПередНачаломОбратныйВызов", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ЗавершениеОбратныйВызов, ПрогрессОбратныйВызов, ПередНачаломОбратныйВызов, ,
		ПараметрыДиалога, ЭтотОбъект.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессОбратныйВызов(ПомещаемыйФайл, Помещено, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт

	ТекстСообщения = СтрШаблон(НСтр("ru = 'Загрузка файла %1'; en = 'Uploading file %1'"), ПомещаемыйФайл.Имя);
	РазмерФайла = СтрШаблон(Нстр("ru = 'Размер файла %1 байт'; en = 'File size %1 bytes'"), ПомещаемыйФайл.Размер());
	
	Состояние(ТекстСообщения, Помещено, РазмерФайла, БиблиотекаКартинок.Картинка);

КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломОбратныйВызов(ПомещаемыйФайл, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт
	ЗначенияКонстант = ЗначенияКонстант();
	МаксимальныйРазмерФото = ЗначенияКонстант["МаксимальныйРазмерФото"];
	МегабайтВБайтах = МаксимальныйРазмерФото * 1000000;
	Если ПомещаемыйФайл.Размер() > МегабайтВБайтах Тогда
		ОтказОтПомещенияФайла = Истина;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Отказ. Загружаемый файл «%1» имеет размер более 5 мегабайт';
		|en = 'Failure. The uploaded file «%1» is larger than 1 megabyte'"), ПомещаемыйФайл.Имя);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		ОтказОтПомещенияФайла = Истина;
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Загрузка файла'; en = 'Uploading file'"), , ПомещаемыйФайл.Имя);
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбратныйВызов(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеПомещенногоФайла.Адрес);
	РасширениеФайла = РасширениеФайлаИзДвоичныхДанных(ДвоичныеДанные);
	ИнициализироватьКартинкуНаФорме(ДвоичныеДанные, РасширениеФайла);

КонецПроцедуры

&НаСервереБезКонтекста
Функция РасширениеФайлаИзДвоичныхДанных(Знач ДвоичныеДанные)
	ШестнадцатеричнаяСтрока = Лев(СтрЗаменить(Строка(ДвоичныеДанные), " ", ""), 16);
	РасширениеФайла = "";
	Если ШестнадцатеричнаяСтрока = "89504E470D0A1A0A" Тогда
		РасширениеФайла = "png";
	ИначеЕсли Лев(ШестнадцатеричнаяСтрока, 6) = "FFD8FF" Тогда
		РасширениеФайла = "jpg";
	ИначеЕсли Лев(ШестнадцатеричнаяСтрока, 8) = "47494638" Тогда
		РасширениеФайла = "gif";
	ИначеЕсли Лев(ШестнадцатеричнаяСтрока, 4) = "424D" Тогда
		РасширениеФайла = "bmp";
	Иначе
		РасширениеФайла = "";
	КонецЕсли;
	
	Возврат РасширениеФайла;
КонецФункции

//&НаКлиенте
//Процедура УстановленныеТМЦ(Команда)
//	Данные = Новый Структура;
//	Данные.Вставить("ОбъектЭксплуатации", Объект.ОбъектЭксплуатации);
////	Данные.Вставить("НомерСтроки", Строка.ПолучитьИдентификатор());
//	Данные.Вставить("ВыбранныйУзел", Объект.Узел);
//	Данные.Вставить("МатериалыКОприходованию", Объект.МатериалыКОприходованию);
//	Данные.Вставить("МатериалыКСписанию", Объект.МатериалыКСписанию);

//	ОткрытьФорму("Документ.мп_ЗаданиеНаРемонт.Форма.ФормаУстановленныеТМЦ",
//		Данные, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДоступностьРеквизитовНаКлиенте()
	ЗапретРедактирования = Ложь;
	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	ОтветственныйИсполнитель = ОтветственныйИсполнитель();
	Если ПраваДоступа.АдминТОиР Или ПраваДоступа.БригадирТОиР Тогда
		Если Объект.Исполнители.Количество() > 0 И Не ОтветственныйИсполнитель Тогда
			СтрСообщение = "Заданию на ремонт уже назначены исполнители. "
				+	"После внесения изменений установите Статус обмена = К выгрузке в КИС. "
				+	"Тем не менее, внесение изменений может привести к рассинхронизации информации";
			ПоказатьПредупреждение(, СтрСообщение, 45);
		КонецЕсли;
	ИначеЕсли ПраваДоступа.МеханикТОиР Тогда
		Если Не ОтветственныйИсполнитель Тогда
			ЗапретРедактирования = Истина;
		КонецЕсли;
	Иначе
		ЗапретРедактирования = Истина;
	КонецЕсли;
	ДоступностьРеквизитов(ЗапретРедактирования);
КонецПроцедуры

&НаСервере
Функция ОтветственныйИсполнитель()
	ТЗИсполнители = Объект.Исполнители.Выгрузить();
	СтрокаИсполнитель = ТЗИсполнители.Найти(ЭтотОбъект.ТекущийПользователь, "Ответственный");
	Возврат (НЕ СтрокаИсполнитель = Неопределено);
КонецФункции

&НаКлиенте
Процедура ИнициализироватьКартинкуНаФорме(ДанныеКартинки, РасширениеФайла)

	Если ДанныеКартинки <> Неопределено Тогда

		ИдентификаторСтроки = Новый УникальныйИдентификатор;
		АдресФото = ПоместитьВоВременноеХранилище(ДанныеКартинки, ИдентификаторСтроки);
		ТекущаяДата = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервера();
		ТекущаяДатаСтрока = Формат( ТекущаяДата, "ДФ='yyyy_MM_dd'") + " время " + Формат( ТекущаяДата, "ДФ='HH_mm_ss'");
		НоваяСтрока = ЭтотОбъект.ТаблицаФотографии.Добавить();
		НоваяСтрока.Фото = ПоместитьКартинку_ФотоФайлДвоичный(ДанныеКартинки);
		НоваяСтрока.ФотоПредставление = АдресФото;
		НоваяСтрока.РасширениеФайла = РасширениеФайла;
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		НоваяСтрока.ИмяФайла = "мп_" + ТекущаяДатаСтрока + "." + РасширениеФайла;
		ДобавитьВТаблицу();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьКартинку_ФотоФайлДвоичный(Знач ДанныеКартинки)

	Строка64  = Base64Строка(ДанныеКартинки);
	Возврат Строка64;

КонецФункции

&НаСервереБезКонтекста
Функция ВычислитьРазностьДат(Знач ДатаНачала, Знач ДатаЗавершения)

	Разность = ДатаЗавершения - ДатаНачала;
	СекундВДне = 86400;
	СекундВЧасе = 3600;
	МинутВЧасе = 60;
	ЧислоДесять = 10;
	
	Если Разность > 0 Тогда
		Дней  = Цел(Разность / СекундВДне);
		Часов = Цел((Разность - Дней * СекундВДне) / СекундВЧасе);
		Минут = Цел(((Разность - (Дней * СекундВДне) - (Часов * СекундВЧасе))) / МинутВЧасе);
		
		Возврат ?(Дней > 0, Строка(Дней) + "дн.", "") + ?((Часов + Минут) > 0, " " + Строка(Часов) + ":" 
			+ ?(Минут < ЧислоДесять, "0", "") + Строка(Минут), ""); 
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ВидимостьРеквизитов()
	ВидимостьУзла = ЗначениеЗаполнено(Объект.ОбъектЭксплуатации);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Узел", "Видимость", ВидимостьУзла);
КонецПроцедуры

&НаСервере
Процедура ЧтениеНаСервере()
	
	ЭтотОбъект.ТехнологическоеМесто = 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектЭксплуатации, "ТехнологическоеМесто");

КонецПроцедуры

&НаСервере
Процедура ТехнологическоеМестоПриИзмененииНаСервере()

	ОбъектЭксплуатации = ОбщегоНазначенияВызовСервера.ОбъектыЭксплуатацииПоТехМесту(
		ЭтотОбъект.ТехнологическоеМесто, Истина);

	Если ТипЗнч(ОбъектЭксплуатации) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		Объект.ОбъектЭксплуатации = ОбъектЭксплуатации;
	Иначе
		Объект.ОбъектЭксплуатации = ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТехнологическоеМестоОбъектаЭксплуатации(Знач ОбъектЭксплуатации)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЭксплуатации, "ТехнологическоеМесто");
КонецФункции

&НаСервере
Процедура ДобавитьВТаблицу()
	Объект.Фотографии.Загрузить(ЭтотОбъект.ТаблицаФотографии.Выгрузить());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияКонстант()
	ЗначенияКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	Возврат ЗначенияКонстант;
КонецФункции

&НаКлиенте
Процедура ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы)
	ИмяСтраницы = ИменаСтраниц[ТекущийИндексСтраницы];
	Страница = Элементы.Найти(ИмяСтраницы);
	Если Страница = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ПредставлениеСтраницы.Заголовок = Страница.Заголовок;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
	Элементы.ГруппаКнопкиСтраниц.Заголовок = "Всего " + Строка(ЭтотОбъект.КоличествоСтраниц) + " этапов";
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ТекущийИндексСтраницы = ИменаСтраниц.Найти(ТекущаяСтраница.Имя);
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РедактированиеФормы(Знач Подразделение, ЗначОтветственный, Знач СтатусОбмена, Знач Источник, Знач Проведен);
	Если РольДоступна("ПолныеПрава") Или РольДоступна("мп_АдминистрированиеТОиР") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Источник = Перечисления.мп_ИсточникиДокументов.КИС Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ДоступностьРеквизитов(Знач ЗакрытьДоступ = Ложь)

	ИсточникКИС = (Объект.Источник = Перечисления.мп_ИсточникиДокументов.КИС);
	АдминТОиР = РольДоступна("мп_АдминистрированиеТОиР");
	БригадирТОиР = РольДоступна("мп_БригадирТОиР");
	МеханикТОиР = РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР");
	
	Мечел_ИзмерениеОбязательно = Ложь;
	Если ЗначениеЗаполнено(Объект.НаименованиеРабот) Тогда
		Мечел_ИзмерениеОбязательно = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Объект.НаименованиеРабот, "Мечел_ИзмерениеОбязательно");
	КонецЕсли;

	РазрешеноИзменять =Новый Массив;
	ЗапрещеноИзменять = Новый Массив;
	
	РазрешеноИзменять.Добавить("ГруппаКнопкиСтраниц");
	РазрешеноИзменять.Добавить("Страница1");
	РазрешеноИзменять.Добавить("Страница2");
	РазрешеноИзменять.Добавить("ГруппаСтраницы");
	РазрешеноИзменять.Добавить("ГруппаШапка");
	РазрешеноИзменять.Добавить("ГруппаНомер");
	РазрешеноИзменять.Добавить("ГруппаОсновная");
	РазрешеноИзменять.Добавить("ГруппаОсновная2");
	РазрешеноИзменять.Добавить("ГруппаФото");
	РазрешеноИзменять.Добавить("ГруппаИсполнители");
	РазрешеноИзменять.Добавить("ГруппаДополнительно");
	РазрешеноИзменять.Добавить("ГруппаСписание");
	РазрешеноИзменять.Добавить("МатериалыКСписанию");
	РазрешеноИзменять.Добавить("МатериалыКСписаниюКонтекстноеМеню");
	РазрешеноИзменять.Добавить("МатериалыКСписаниюКонтекстноеМенюИзменитьМатериалКСписанию");
	
	РазрешеноИзменять.Добавить("ГруппаОприходование");
	РазрешеноИзменять.Добавить("МатериалыКОприходованию");
	РазрешеноИзменять.Добавить("МатериалыКОприходованиюКонтекстноеМеню");
	РазрешеноИзменять.Добавить("МатериалыКОприходованиюКонтекстноеМенюИзменитьМатериалыКОприходованию");
	РазрешеноИзменять.Добавить("СтатусОбмена");
	
	Если Не ЗакрытьДоступ Тогда
		ЕстьВыполнение
			= Документы.мп_ЗаданиеНаРемонт.СостояниеВыполнениеОперации(Объект.ВыполнениеОперации);
		ЗакрытьДоступ = (Объект.Проведен И ЕстьВыполнение);
	КонецЕсли;
	
	Если Мечел_ИзмерениеОбязательно И Не ИсточникКИС И Не ЗакрытьДоступ Тогда
		РазрешеноИзменять.Добавить("ПоказательИзмерения");
		РазрешеноИзменять.Добавить("ВидПроверки");
	Иначе
		ЗапрещеноИзменять.Добавить("ПоказательИзмерения");
		ЗапрещеноИзменять.Добавить("ВидПроверки");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВидПроверки) И Не ИсточникКИС И Не ЗакрытьДоступ Тогда
		РазрешеноИзменять.Добавить("РезультатПроверки");
	Иначе
		ЗапрещеноИзменять.Добавить("РезультатПроверки");
	КонецЕсли;

	СписокСтатусовОбмена = Новый Массив;
	СписокСтатусовОбмена.Добавить(Перечисления.мп_СтатусыОбмена.Создан);
	СписокСтатусовОбмена.Добавить(Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС);

	Если АдминТОиР Или (БригадирТОиР И СписокСтатусовОбмена.Найти(Объект.СтатусОбмена) <> Неопределено) И Не ЗакрытьДоступ Тогда
		РазрешеноИзменять.Добавить("ИсполнителиДобавитьИсполнителя");
		РазрешеноИзменять.Добавить("ИсполнителиКонтекстноеМенюИзменитьСтрокуИсполнителя");
		РазрешеноИзменять.Добавить("ИсполнителиКонтекстноеМенюУдалитьСтрокуИсполнителя");
	Иначе
		ЗапрещеноИзменять.Добавить("ИсполнителиДобавитьИсполнителя");
		ЗапрещеноИзменять.Добавить("ИсполнителиКонтекстноеМенюИзменитьСтрокуИсполнителя");
		ЗапрещеноИзменять.Добавить("ИсполнителиКонтекстноеМенюУдалитьСтрокуИсполнителя");
	КонецЕсли;
	Если Не ИсточникКИС И Не ЗакрытьДоступ Тогда
		РазрешеноИзменять.Добавить("Дата");
	КонецЕсли;
	
	ЗапрещеноИзменять.Добавить("Источник");
	
	Если ИсточникКИС Или ЗакрытьДоступ Тогда
		ЗапрещеноИзменять.Добавить("МатериалыКСписаниюКонтекстноеМенюУдалитьСтрокуСписания");
		ЗапрещеноИзменять.Добавить("МатериалыКОприходованиюКонтекстноеМенюУдалитьСтрокуОприходования");
		ЗапрещеноИзменять = 
			ОбщегоНазначения.ЗапрещаемыеЭлементы(Элементы, РазрешеноИзменять, ЗапрещеноИзменять);
	КонецЕсли;

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, РазрешеноИзменять, "Доступность", Истина);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ЗапрещеноИзменять, "Доступность", Ложь) ;

КонецПроцедуры

&НаСервере
Процедура ВыполнениеОперацииПриИзмененииСервер(Знач ВыбранноеЗначение)
	
	Мечел_ИзмерениеОбязательно = Ложь;
	мп_ПроверкаОбязательна = Ложь;
	Если ЗначениеЗаполнено(Объект.НаименованиеРабот) Тогда
		РеквизитыРабот = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Объект.НаименованиеРабот, "Мечел_ИзмерениеОбязательно, мп_ПроверкаОбязательна");
		Мечел_ИзмерениеОбязательно = РеквизитыРабот.Мечел_ИзмерениеОбязательно;
		мп_ПроверкаОбязательна = РеквизитыРабот.мп_ПроверкаОбязательна;
	КонецЕсли;
	ПустаяДатаИзмерения = (Объект.ДатаИзмеренияПроверкиВыполнения = Дата(1, 1, 1));
	Если ВыбранноеЗначение = """Да""" Тогда
		Если Объект.Источник = Перечисления.мп_ИсточникиДокументов.МечелТОиР Тогда
			Если Мечел_ИзмерениеОбязательно 
			И ЗначениеЗаполнено(Объект.ПоказательИзмерения)
			И Объект.ЗначениеПоказателяИзмерения <> 0
			И ПустаяДатаИзмерения Тогда
				
				Объект.ДатаИзмеренияПроверкиВыполнения = ТекущаяДатаСеанса();
				
			ИначеЕсли мп_ПроверкаОбязательна  
			И ЗначениеЗаполнено(Объект.ВидПроверки)
			И ПустаяДатаИзмерения Тогда
				
				Объект.ДатаИзмеренияПроверкиВыполнения = ТекущаяДатаСеанса();
				
			ИначеЕсли Не Мечел_ИзмерениеОбязательно
			И Не мп_ПроверкаОбязательна
			И ПустаяДатаИзмерения Тогда

				Объект.ДатаИзмеренияПроверкиВыполнения = ТекущаяДатаСеанса();

			КонецЕсли;
		Иначе
			Если ПустаяДатаИзмерения Тогда
				Объект.ДатаИзмеренияПроверкиВыполнения = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВыбранноеЗначение = "" Или ВыбранноеЗначение = """Нет""" Тогда
		Объект.ДатаИзмеренияПроверкиВыполнения = ПустаяДатаИзмерения;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗначениеПоказателяИзмеренияПриИзмененииНаСервере()
	ПустаяДатаИзмерения = (Объект.ДатаИзмеренияПроверкиВыполнения = Дата(1, 1, 1));
	Если ЗначениеЗаполнено(Объект.ВыполнениеОперации) 
		И Объект.ЗначениеПоказателяИзмерения <> 0 И ПустаяДатаИзмерения Тогда
		
		Объект.ДатаИзмеренияПроверкиВыполнения = ТекущаяДатаСеанса();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РезультатПроверкиПриИзмененииНаСервере()
	ПустаяДатаИзмерения = (Объект.ДатаИзмеренияПроверкиВыполнения = Дата(1, 1, 1));
	Если Объект.РезультатПроверки И ЗначениеЗаполнено(Объект.ВыполнениеОперации) 
	И  ПустаяДатаИзмерения Тогда
		Объект.ДатаИзмеренияПроверкиВыполнения = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НаименованиеРаботПриИзмененииНаСервере()
	Если Объект.Источник = Перечисления.мп_ИсточникиДокументов.МечелТОиР Тогда
		Если ЗначениеЗаполнено(Объект.НаименованиеРабот) Тогда
			Объект.ФотоотчетОбязателен = 
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.НаименованиеРабот, "Мечел_ФотоотчетОбязателен");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;

КонецПроцедуры

&НаСервере
Функция КонтрольОстатковМатериаловСписания()

	ТЗ = Объект.МатериалыКСписанию.Выгрузить();
//	СписокОшибок = ЗаданиеНаРемонтВызовСервераЛокализация.КонтрольОстатковМатериаловСписания(ТЗ, Объект.Дата);
	СписокОшибок = ЗаданиеНаРемонтВызовСервераЛокализация.КонтрольОстатковМатериаловСписания(ТЗ, ТекущаяДатаСеанса());
	Возврат СписокОшибок;

КонецФункции

&НаСервереБезКонтекста
Функция ОбновлениеНоменклатуры()
	Возврат ОбменСервер.ОбновлениеОстатков("updatecatalogs");
КонецФункции

&НаКлиенте
Процедура ОбновлениеОстатков(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Результат = ОбновлениеНоменклатуры();
		Если Результат Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				"Остатки обновлены, можно повторно провести документ.");
		иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				"Ошибка загрузки остатков. Запишите документ без проведения и попробуйте обновить остатки");
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Запишите документ без проведения и попробуйте обновить остатки");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтветственныйПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Объект.Ответственный, "Подразделение");
	Иначе
		Объект.Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыКСписаниюПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусОбмена()
	Если Объект.ВыполнениеОперации = """Да""" И Объект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан Тогда
		Объект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидыРемонтов(ОбъектЭксплуатации)
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ОбъектЭксплуатации", ОбъектЭксплуатации);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыЭксплуатации.Класс КАК Класс
	|ПОМЕСТИТЬ вт_Классы
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|ГДЕ
	|	ОбъектыЭксплуатации.Ссылка = &ОбъектЭксплуатации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыРемонтов.Ссылка КАК ВидРемонта
	|ИЗ
	|	вт_Классы КАК вт_Классы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыРемонтов КАК ВидыРемонтов
	|		ПО (ВидыРемонтов.Владелец = вт_Классы.Класс)";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("ВидРемонта");
	КонецЕсли;

КонецФункции

Процедура ОбновитьИсполнителейВНаряде(ЗаданиеНаРемонт)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаданиеНаРемонт", ЗаданиеНаРемонт);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	мп_НарядНаРемонтРаботы.Ссылка КАК НарядНаРемонт,
	|	мп_НарядНаРемонтРаботы.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.мп_НарядНаРемонт.Работы КАК мп_НарядНаРемонтРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_ЗаданиеНаРемонт КАК мп_ЗаданиеНаРемонт
	|		ПО ((ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.мп_ЗаданиеНаРемонт)) = мп_ЗаданиеНаРемонт.Ссылка)
	|			И (&ЗаданиеНаРемонт = мп_ЗаданиеНаРемонт.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_НарядНаРемонт КАК мп_НарядНаРемонт
	|		ПО (мп_НарядНаРемонтРаботы.Ссылка = мп_НарядНаРемонт.Ссылка)
	|ГДЕ
	|	НЕ мп_НарядНаРемонт.ПометкаУдаления";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	НарядНаРемонт = Выборка.НарядНаРемонт.ПолучитьОбъект();
	
	ТЗИсполнители = НарядНаРемонт.Исполнители.Выгрузить();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиРаботы", Выборка.ИдентификаторСтроки);
	СтрокиИсполнителей = ТЗИсполнители.НайтиСтроки(Отбор);
	Для Каждого ТекСтрока Из СтрокиИсполнителей Цикл
		ТЗИсполнители.Удалить(ТекСтрока);
	КонецЦикла;
	Ответственные = Новый Массив;
	Для Каждого ТекСтрока Из Объект.Исполнители Цикл
		НоваяСтрока = ТЗИсполнители.Добавить();
		НоваяСтрока.Ответственный = ТекСтрока.Ответственный;
		НоваяСтрока.ИдентификаторСтрокиРаботы = Выборка.ИдентификаторСтроки;
		Ответственные.Добавить(ТекСтрока.Ответственный);
	КонецЦикла;
	НарядНаРемонт.Исполнители.Загрузить(ТЗИсполнители);
	Для Каждого ТекСтрока Из НарядНаРемонт.Работы Цикл
		Если ТекСтрока.ИдентификаторСтроки = Выборка.ИдентификаторСтроки Тогда
			ТекСтрока.Исполнители = СтрСоединить(Ответственные, ", ");
			Прервать;
		КонецЕсли;
	КонецЦикла;

	НарядНаРемонт.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

#КонецОбласти
